# 1. Реализовать алгоритм задания случайного числа без генератора случайных чисел

import time

seconds = time.time()
print(int(seconds) % 100)

